tylertms/dspic33e-sim/conformance/processor.c
static void dsp_prefetch_destination_collision_cases(ProcessorConformance* state,
                                                     Dspic33* cpu) {
    static const struct {
        uint32_t opcode;
        uint8_t destination;
        const char* execution;
    } cases[] = {
        {OPCODE_DSP_PREFETCH_W4_COLLISION, 4u, "DSP prefetch collision resolves W4"},
        {OPCODE_DSP_PREFETCH_W5_COLLISION, 5u, "DSP prefetch collision resolves W5"},
        {OPCODE_DSP_PREFETCH_W6_COLLISION, 6u, "DSP prefetch collision resolves W6"},
        {OPCODE_DSP_PREFETCH_W7_COLLISION, 7u, "DSP prefetch collision resolves W7"},
    };
    size_t index;

    for (index = 0u; index < sizeof(cases) / sizeof(cases[0]); index++) {
        dspic33_reset(cpu, 0u);
        load_instruction(state, cpu, 0u, cases[index].opcode);
        dspic33_set_working_register(cpu, 4u, 3u);
        dspic33_set_working_register(cpu, 5u, 4u);
        dspic33_set_working_register(cpu, 6u, 0x6666u);
        dspic33_set_working_register(cpu, 7u, 0x7777u);
        dspic33_set_working_register(cpu, 8u, 0x5000u);
        dspic33_set_working_register(cpu, 10u, 0x9002u);
        dspic33_write_word(cpu, 0x5000u, 0x1111u);
        dspic33_write_word(cpu, 0x9002u, 0x2222u);
        cpu->corcon = 0x0001u;
        cpu->sr = 0x000fu;
        expect(state,
               dspic33_step(cpu) == DSPIC33_RUNNING && cpu->cycles == 1u &&
                   cpu->accumulator[0] == 12 &&
                   cpu->w[cases[index].destination] == 0x2222u,
               cases[index].execution);
        expect(
            state,
            cpu->w[8] == 0x5002u && cpu->w[10] == 0x9004u && cpu->sr == 0x000fu &&
                cpu->corcon == 0x0001u && cpu->illegal_reset_count == 0u,
            "DSP prefetch collision completes both lanes and preserves control state");
    }

    dspic33_reset(cpu, 0u);
    load_instruction(state, cpu, 0u, OPCODE_DSP_MOVSAC_W4_COLLISION);
    dspic33_set_working_register(cpu, 4u, 0x4444u);
    dspic33_set_working_register(cpu, 8u, 0x5000u);
    dspic33_set_working_register(cpu, 10u, 0x9002u);
    dspic33_write_word(cpu, 0x5000u, 0x1111u);
    dspic33_write_word(cpu, 0x9002u, 0x2222u);
    cpu->accumulator[0] = 0x123456789a;
    cpu->accumulator[1] = -0x123456789a;
    cpu->corcon = 0x0001u;
    cpu->sr = 0x010fu;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->cycles == 1u &&
               cpu->w[4] == 0x2222u && cpu->w[8] == 0x5002u && cpu->w[10] == 0x9004u,
           "MOVSAC prefetch collision resolves W4 after both lanes complete");
    expect(state,
           cpu->accumulator[0] == 0x123456789a &&
               cpu->accumulator[1] == -0x123456789a && cpu->sr == 0x010fu &&
               cpu->corcon == 0x0001u && cpu->illegal_reset_count == 0u,
           "MOVSAC prefetch collision preserves accumulators and control state");
}

typedef struct {
    uint8_t register_offset;
    int8_t access_offset;
    int8_t update;
    bool present;
} DspMatrixPrefetch;

enum {
    DSP_MATRIX_WRITE_BACK_DIRECT = 0u,
    DSP_MATRIX_WRITE_BACK_INDIRECT = 1u,
    DSP_MATRIX_WRITE_BACK_NONE = 2u
};

static const DspMatrixPrefetch dsp_matrix_prefetches[16] = {
    {0u, 0, 0, true},  {0u, 0, 2, true},  {0u, 0, 4, true},  {0u, 0, 6, true},
    {0u, 0, 0, false}, {0u, 0, -6, true}, {0u, 0, -4, true}, {0u, 0, -2, true},
    {1u, 0, 0, true},  {1u, 0, 2, true},  {1u, 0, 4, true},  {1u, 0, 6, true},
    {1u, 2, 0, true},  {1u, 0, -6, true}, {1u, 0, -4, true}, {1u, 0, -2, true},
};

static uint16_t dsp_matrix_base_value(uint8_t reg) {
    static const uint16_t values[4] = {0x5008u, 0x5108u, 0x9008u, 0x9108u};
    return values[reg - 8u];
}

static uint16_t dsp_matrix_prefetch_value(bool y_space, uint8_t operation) {
    return (uint16_t)((y_space ? 0x2200u : 0x1100u) | operation);
}

static void prepare_dsp_matrix_case(Dspic33* cpu, uint8_t target_accumulator,
                                    uint8_t x_operation, uint8_t y_operation,
                                    uint16_t expected_w[14]) {
    static const uint16_t values[10] = {
        2u, 3u, 5u, 7u, 0x5008u, 0x5108u, 0x9008u, 0x9108u, 2u, 0x5200u,
    };
    const DspMatrixPrefetch* x = &dsp_matrix_prefetches[x_operation];
    const DspMatrixPrefetch* y = &dsp_matrix_prefetches[y_operation];
    uint8_t reg;

    cpu->pc = 0u;
    cpu->sr = 0x000fu;
    cpu->corcon = 0x0001u;
    cpu->accumulator[target_accumulator] = 100;
    cpu->accumulator[target_accumulator ^ 1u] = 0x12348001;
    cpu->previous_working_register_writes = 0u;
    cpu->unsupported_opcode = 0u;
    cpu->last_trap = UINT16_MAX;
    cpu->last_interrupt = UINT16_MAX;
    cpu->address_error = false;
    cpu->illegal_reset = false;
    cpu->stop_reason = DSPIC33_RUNNING;
    cpu->instruction_active = false;
    cpu->repeat_active = 0u;
    cpu->events.count = 0u;
    for (reg = 4u; reg <= 13u; reg++) {
        dspic33_set_working_register(cpu, reg, values[reg - 4u]);
        expected_w[reg] = values[reg - 4u];
    }
    dspic33_write_word(cpu, 0x5200u, 0xa5a5u);
    if (x->present) {
        uint8_t base = (uint8_t)(8u + x->register_offset);
        dspic33_write_word(cpu,
                           (uint16_t)(dsp_matrix_base_value(base) + x->access_offset),
                           dsp_matrix_prefetch_value(false, x_operation));
    }
    if (y->present) {
        uint8_t base = (uint8_t)(10u + y->register_offset);
        dspic33_write_word(cpu,
                           (uint16_t)(dsp_matrix_base_value(base) + y->access_offset),
                           dsp_matrix_prefetch_value(true, y_operation));
    }
}

static void apply_dsp_matrix_prefetch(uint16_t expected_w[14], uint8_t operation,
                                      uint8_t destination, bool y_space,
                                      bool write_destination) {
    const DspMatrixPrefetch* prefetch = &dsp_matrix_prefetches[operation];
    uint8_t base;
    if (!prefetch->present) {
        return;
    }
    base = (uint8_t)((y_space ? 10u : 8u) + prefetch->register_offset);
    expected_w[base] = (uint16_t)(dsp_matrix_base_value(base) + prefetch->update);
    if (write_destination) {
        expected_w[destination] = dsp_matrix_prefetch_value(y_space, operation);
    }
}

static void expect_dsp_matrix_case(ProcessorConformance* state, bool condition,
                                   uint32_t opcode, const char* domain) {
    state->cases++;
    if (condition) {
        state->passed++;
        return;
    }
    state->failed++;
    printf("[processor-failed] %s opcode=%06" PRIx32 "\n", domain, opcode);
}

static void run_legal_dsp_matrix_case(ProcessorConformance* state, Dspic33* cpu,
                                      uint32_t opcode, uint8_t target_accumulator,
                                      int64_t target_result, uint8_t x_operation,
                                      uint8_t y_operation, uint8_t x_destination,
                                      uint8_t y_destination, uint8_t write_back,
                                      int8_t difference_destination) {
    uint16_t expected_w[14] = {0u};
    uint16_t expected_memory = 0xa5a5u;
    uint64_t cycles;
    bool matches;
    uint8_t reg;

    prepare_dsp_matrix_case(cpu, target_accumulator, x_operation, y_operation,
                            expected_w);
    apply_dsp_matrix_prefetch(expected_w, x_operation, x_destination, false,
                              difference_destination < 0);
    apply_dsp_matrix_prefetch(expected_w, y_operation, y_destination, true,
                              difference_destination < 0);
    if (difference_destination >= 0) {
        expected_w[(uint8_t)difference_destination] =
            (uint16_t)(dsp_matrix_prefetch_value(false, x_operation) -
                       dsp_matrix_prefetch_value(true, y_operation));
    }
    if (write_back == DSP_MATRIX_WRITE_BACK_DIRECT) {
        expected_w[13] = 0x1235u;
    } else if (write_back == DSP_MATRIX_WRITE_BACK_INDIRECT) {
        expected_w[13] = 0x5202u;
        expected_memory = 0x1235u;
    }
    cycles = cpu->cycles;
    matches = dspic33_load_program_word(cpu, 0u, opcode) &&
              dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 2u &&
              cpu->cycles - cycles == 1u &&
              cpu->accumulator[target_accumulator] == target_result &&
              cpu->accumulator[target_accumulator ^ 1u] == 0x12348001 &&
              cpu->sr == 0x000fu && cpu->corcon == 0x0001u &&
              dspic33_read_word(cpu, 0x5200u) == expected_memory &&
              !cpu->address_error && !cpu->illegal_reset &&
              cpu->unsupported_opcode == 0u && cpu->last_trap == UINT16_MAX;
    for (reg = 4u; reg <= 13u; reg++) {
        matches = matches && cpu->w[reg] == expected_w[reg];
    }
    expect_dsp_matrix_case(state, matches, opcode, "legal DSP encoding");
}

static void general_dsp_encoding_matrix_cases(ProcessorConformance* state, Dspic33* cpu,
                                              uint32_t* legal_cases) {
    static const uint8_t pair_encodings[6] = {0u, 1u, 2u, 4u, 5u, 6u};
    static const uint8_t pair_left[6] = {0u, 0u, 0u, 1u, 1u, 2u};
    static const uint8_t pair_right[6] = {1u, 2u, 3u, 2u, 3u, 3u};
    static const int64_t operands[4] = {2, 3, 5, 7};
    static const struct {
        uint16_t bits;
        int8_t sign;
        bool replace;
        uint8_t write_back;
    } forms[8] = {
        {0x0003u, 1, true, DSP_MATRIX_WRITE_BACK_NONE},
        {0x4003u, -1, true, DSP_MATRIX_WRITE_BACK_NONE},
        {0x0002u, 1, false, DSP_MATRIX_WRITE_BACK_NONE},
        {0x0000u, 1, false, DSP_MATRIX_WRITE_BACK_DIRECT},
        {0x0001u, 1, false, DSP_MATRIX_WRITE_BACK_INDIRECT},
        {0x4002u, -1, false, DSP_MATRIX_WRITE_BACK_NONE},
        {0x4000u, -1, false, DSP_MATRIX_WRITE_BACK_DIRECT},
        {0x4001u, -1, false, DSP_MATRIX_WRITE_BACK_INDIRECT},
    };
    uint8_t pair;
    uint8_t accumulator;
    uint8_t form;
    uint8_t x_operation;
    uint8_t y_operation;
    uint8_t x_destination;
    uint8_t y_destination;

    for (pair = 0u; pair < 6u; pair++) {
        int64_t product = operands[pair_left[pair]] * operands[pair_right[pair]];
        for (accumulator = 0u; accumulator < 2u; accumulator++) {
            for (form = 0u; form < 8u; form++) {
                int64_t result = forms[form].sign * product;
                if (!forms[form].replace) {
                    result += 100;
                }
                for (x_operation = 0u; x_operation < 16u; x_operation++) {
                    for (y_operation = 0u; y_operation < 16u; y_operation++) {
                        for (x_destination = 0u; x_destination < 4u; x_destination++) {
                            for (y_destination = 0u; y_destination < 4u;
                                 y_destination++) {
                                uint32_t opcode =
                                    0xc00000u |
                                    ((uint32_t)pair_encodings[pair] << 16u) |
                                    ((uint32_t)accumulator << 15u) |
                                    ((uint32_t)x_destination << 12u) |
                                    ((uint32_t)y_destination << 10u) |
                                    ((uint32_t)x_operation << 6u) |
                                    ((uint32_t)y_operation << 2u) | forms[form].bits;
                                run_legal_dsp_matrix_case(state, cpu, opcode,
                                                          accumulator, result,
                                                          x_operation, y_operation,
                                                          (uint8_t)(4u + x_destination),
                                                          (uint8_t)(4u + y_destination),
                                                          forms[form].write_back, -1);
                                (*legal_cases)++;
                            }
                        }
                    }
                }
            }
        }
    }
}

static void special_dsp_encoding_matrix_cases(ProcessorConformance* state, Dspic33* cpu,
                                              uint32_t* legal_cases) {
    static const uint32_t families[2] = {0xc30000u, 0xc70000u};
    uint8_t family;
    uint8_t accumulator;
    uint8_t write_back;
    uint8_t x_operation;
    uint8_t y_operation;
    uint8_t x_destination;
    uint8_t y_destination;

    for (family = 0u; family < 2u; family++) {
        for (accumulator = 0u; accumulator < 2u; accumulator++) {
            for (write_back = 0u; write_back < 3u; write_back++) {
                for (x_operation = 0u; x_operation < 16u; x_operation++) {
                    for (y_operation = 0u; y_operation < 16u; y_operation++) {
                        for (x_destination = 0u; x_destination < 4u; x_destination++) {
                            for (y_destination = 0u; y_destination < 4u;
                                 y_destination++) {
                                uint32_t opcode =
                                    families[family] | ((uint32_t)accumulator << 15u) |
                                    ((uint32_t)x_destination << 12u) |
                                    ((uint32_t)y_destination << 10u) |
                                    ((uint32_t)x_operation << 6u) |
                                    ((uint32_t)y_operation << 2u) | write_back;
                                run_legal_dsp_matrix_case(
                                    state, cpu, opcode, accumulator,
                                    family == 0u ? 0 : 100, x_operation, y_operation,
                                    (uint8_t)(4u + x_destination),
                                    (uint8_t)(4u + y_destination), write_back, -1);
                                (*legal_cases)++;
                            }
                        }
                    }
                }
            }
        }
    }
}

static void square_dsp_encoding_matrix_cases(ProcessorConformance* state, Dspic33* cpu,
                                             uint32_t* legal_cases) {
    static const int64_t operands[4] = {2, 3, 5, 7};
    uint8_t source;
    uint8_t accumulator;
    uint8_t replace;
    uint8_t x_operation;
    uint8_t y_operation;
    uint8_t x_destination;
    uint8_t y_destination;

    for (source = 0u; source < 4u; source++) {
        int64_t product = operands[source] * operands[source];
        for (accumulator = 0u; accumulator < 2u; accumulator++) {
            for (replace = 0u; replace < 2u; replace++) {
                int64_t result = replace != 0u ? product : 100 + product;
                for (x_operation = 0u; x_operation < 16u; x_operation++) {
                    for (y_operation = 0u; y_operation < 16u; y_operation++) {
                        for (x_destination = 0u; x_destination < 4u; x_destination++) {
                            for (y_destination = 0u; y_destination < 4u;
                                 y_destination++) {
                                uint32_t opcode =
                                    0xf00000u | ((uint32_t)source << 16u) |
                                    ((uint32_t)accumulator << 15u) |
                                    ((uint32_t)x_destination << 12u) |
                                    ((uint32_t)y_destination << 10u) |
                                    ((uint32_t)x_operation << 6u) |
                                    ((uint32_t)y_operation << 2u) | replace;
                                run_legal_dsp_matrix_case(
                                    state, cpu, opcode, accumulator, result,
                                    x_operation, y_operation,
                                    (uint8_t)(4u + x_destination),
                                    (uint8_t)(4u + y_destination),
                                    DSP_MATRIX_WRITE_BACK_NONE, -1);
                                (*legal_cases)++;
                            }
                        }
                    }
                }
            }
        }
    }
}

static void euclidean_dsp_encoding_matrix_cases(ProcessorConformance* state,
                                                Dspic33* cpu, uint32_t* legal_cases) {
    static const int64_t operands[4] = {2, 3, 5, 7};
    uint8_t source;
    uint8_t accumulator;
    uint8_t operation;
    uint8_t destination;
    uint8_t x_operation;
    uint8_t y_operation;

    for (source = 0u; source < 4u; source++) {
        int64_t product = operands[source] * operands[source];
        for (accumulator = 0u; accumulator < 2u; accumulator++) {
            for (operation = 2u; operation < 4u; operation++) {
                int64_t result = operation == 2u ? 100 + product : product;
                for (destination = 0u; destination < 4u; destination++) {
                    for (x_operation = 0u; x_operation < 16u; x_operation++) {
                        if (x_operation == 4u) {
                            continue;
                        }
                        for (y_operation = 0u; y_operation < 16u; y_operation++) {
                            uint32_t opcode;
                            if (y_operation == 4u) {
                                continue;
                            }
                            opcode = 0xf04000u | ((uint32_t)source << 16u) |
                                     ((uint32_t)accumulator << 15u) |
                                     ((uint32_t)destination << 12u) |
                                     ((uint32_t)x_operation << 6u) |
                                     ((uint32_t)y_operation << 2u) | operation;
                            run_legal_dsp_matrix_case(
                                state, cpu, opcode, accumulator, result, x_operation,
                                y_operation, 4u, 4u, DSP_MATRIX_WRITE_BACK_NONE,
                                (int8_t)(4u + destination));
                            (*legal_cases)++;
                        }
                    }
                }
            }
        }
    }
}

static void prepare_invalid_dsp_matrix_case(Dspic33* cpu) {
    uint8_t reg;
    cpu->pc = 0u;
    cpu->sr = 0x010fu;
    cpu->corcon = 0x0001u;
    cpu->accumulator[0] = 0x123456789a;
    cpu->accumulator[1] = -0x123456789a;
    cpu->illegal_reset = false;
    cpu->last_trap = UINT16_MAX;
    cpu->stop_reason = DSPIC33_RUNNING;
    for (reg = 0u; reg < 15u; reg++) {
        dspic33_set_working_register(cpu, reg,
                                     (uint16_t)(0x5000u + (uint16_t)reg * 2u));
    }
    dspic33_write_word(cpu, 0x5000u, 0xa5a5u);
}

static void run_invalid_dsp_matrix_case(ProcessorConformance* state, Dspic33* cpu,
                                        uint32_t opcode) {
    uint64_t illegal_resets;
    bool matches;
    uint8_t reg;

