tylertms/dspic33e-sim/conformance/processor.c
    prepare_invalid_dsp_matrix_case(cpu);
    illegal_resets = cpu->illegal_reset_count;
    matches = dspic33_load_program_word(cpu, 0u, opcode) &&
              dspic33_step(cpu) == DSPIC33_RUNNING && cpu->illegal_reset &&
              cpu->illegal_reset_count == illegal_resets + 1u &&
              cpu->software_reset_count == 0u && cpu->trap_count == 0u &&
              cpu->last_trap == UINT16_MAX && cpu->pc == 0u && cpu->w[15] == 0x1000u &&
              cpu->initialized_working_registers == 0x8000u &&
              (dspic33_read_word(cpu, 0x0740u) & 0x4000u) != 0u &&
              dspic33_read_word(cpu, 0x5000u) == 0xa5a5u;
    for (reg = 0u; reg < 15u; reg++) {
        matches = matches && cpu->w[reg] == 0u;
    }
    expect_dsp_matrix_case(state, matches, opcode, "illegal DSP encoding");
}

static void invalid_dsp_encoding_matrix_cases(ProcessorConformance* state, Dspic33* cpu,
                                              uint32_t* invalid_cases) {
    uint8_t pair;
    uint8_t accumulator;
    uint8_t alternate;
    uint8_t x_destination;
    uint8_t y_destination;
    uint8_t x_operation;
    uint8_t y_operation;
    uint8_t low;

    for (pair = 0u; pair < 8u; pair++) {
        for (accumulator = 0u; accumulator < 2u; accumulator++) {
            for (alternate = 0u; alternate < 2u; alternate++) {
                for (x_destination = 0u; x_destination < 4u; x_destination++) {
                    for (y_destination = 0u; y_destination < 4u; y_destination++) {
                        for (x_operation = 0u; x_operation < 16u; x_operation++) {
                            for (y_operation = 0u; y_operation < 16u; y_operation++) {
                                for (low = 0u; low < 4u; low++) {
                                    bool valid = (pair != 3u && pair != 7u) ||
                                                 (alternate == 0u && low != 3u);
                                    uint32_t opcode;
                                    if (valid) {
                                        continue;
                                    }
                                    opcode = 0xc00000u | ((uint32_t)pair << 16u) |
                                             ((uint32_t)accumulator << 15u) |
                                             ((uint32_t)alternate << 14u) |
                                             ((uint32_t)x_destination << 12u) |
                                             ((uint32_t)y_destination << 10u) |
                                             ((uint32_t)x_operation << 6u) |
                                             ((uint32_t)y_operation << 2u) | low;
                                    run_invalid_dsp_matrix_case(state, cpu, opcode);
                                    (*invalid_cases)++;
                                }
                            }
                        }
                    }
                }
            }
        }
    }

    for (pair = 0u; pair < 4u; pair++) {
        for (accumulator = 0u; accumulator < 2u; accumulator++) {
            for (alternate = 0u; alternate < 2u; alternate++) {
                for (x_destination = 0u; x_destination < 4u; x_destination++) {
                    for (y_destination = 0u; y_destination < 4u; y_destination++) {
                        for (x_operation = 0u; x_operation < 16u; x_operation++) {
                            for (y_operation = 0u; y_operation < 16u; y_operation++) {
                                for (low = 0u; low < 4u; low++) {
                                    bool valid = alternate == 0u
                                                     ? low < 2u
                                                     : low >= 2u &&
                                                           y_destination == 0u &&
                                                           x_operation != 4u &&
                                                           y_operation != 4u;
                                    uint32_t opcode;
                                    if (valid) {
                                        continue;
                                    }
                                    opcode = 0xf00000u | ((uint32_t)pair << 16u) |
                                             ((uint32_t)accumulator << 15u) |
                                             ((uint32_t)alternate << 14u) |
                                             ((uint32_t)x_destination << 12u) |
                                             ((uint32_t)y_destination << 10u) |
                                             ((uint32_t)x_operation << 6u) |
                                             ((uint32_t)y_operation << 2u) | low;
                                    run_invalid_dsp_matrix_case(state, cpu, opcode);
                                    (*invalid_cases)++;
                                }
                            }
                        }
                    }
                }
            }
        }
    }
}

static void dsp_encoding_matrix_cases(ProcessorConformance* state, Dspic33* cpu) {
    uint32_t legal_cases = 0u;
    uint32_t invalid_cases = 0u;

    dspic33_reset(cpu, 0u);
    dspic33_set_async_events(cpu, false);
    general_dsp_encoding_matrix_cases(state, cpu, &legal_cases);
    special_dsp_encoding_matrix_cases(state, cpu, &legal_cases);
    square_dsp_encoding_matrix_cases(state, cpu, &legal_cases);
    euclidean_dsp_encoding_matrix_cases(state, cpu, &legal_cases);
    invalid_dsp_encoding_matrix_cases(state, cpu, &invalid_cases);
    expect(state, legal_cases == 522304u, "DSP legal encoding matrix is exhaustive");
    expect(state, invalid_cases == 264128u,
           "DSP illegal encoding matrix is exhaustive");
}

static int64_t generic_multiply_operand(uint16_t value, bool signed_value) {
    return signed_value ? (int16_t)value : value;
}

static uint16_t generic_multiply_source_value(uint8_t mode) {
    static const uint16_t values[6] = {
        0u, 0x8003u, 0x8003u, 0x8003u, 0x8005u, 0x8007u,
    };
    return values[mode];
}

static void prepare_generic_multiply_case(Dspic33* cpu, uint8_t source_mode,
                                          uint8_t source_register,
                                          uint16_t expected_w[16]) {
    uint8_t reg;
    cpu->pc = 0u;
    cpu->sr = 0x010fu;
    cpu->corcon = 0x0005u;
    cpu->accumulator[0] = 0x1111222233;
    cpu->accumulator[1] = -0x1111222233;
    cpu->previous_working_register_writes = 0u;
    cpu->unsupported_opcode = 0u;
    cpu->last_trap = UINT16_MAX;
    cpu->last_interrupt = UINT16_MAX;
    cpu->address_error = false;
    cpu->illegal_reset = false;
    cpu->stop_reason = DSPIC33_RUNNING;
    cpu->instruction_active = false;
    cpu->repeat_active = 0u;
    cpu->events.count = 0u;
    cpu->splim_enabled = false;
    for (reg = 0u; reg < 16u; reg++) {
        uint16_t value = (uint16_t)(0x8000u + (uint16_t)reg * 2u);
        dspic33_set_working_register(cpu, reg, value);
        expected_w[reg] = cpu->w[reg];
    }
    if (source_mode != 0u && source_mode < 6u) {
        dspic33_set_working_register(cpu, source_register, 0x5008u);
        expected_w[source_register] = 0x5008u;
        dspic33_write_word(cpu, 0x5006u, 0x8005u);
        dspic33_write_word(cpu, 0x5008u, 0x8003u);
        dspic33_write_word(cpu, 0x500au, 0x8007u);
    }
}

static void run_legal_generic_multiply_case(ProcessorConformance* state, Dspic33* cpu,
                                            uint32_t opcode, bool base_signed,
                                            bool source_signed, uint8_t base_register,
                                            uint8_t destination, uint8_t source_mode,
                                            uint8_t source_register) {
    uint16_t expected_w[16] = {0u};
    int64_t expected_accumulator[2] = {0x1111222233, -0x1111222233};
    uint16_t source;
    int64_t product;
    uint64_t cycles;
    bool matches;
    uint8_t reg;

