tylertms/dspic33e-sim/conformance/processor.c
int main(void) {
    ProcessorConformance state = {0u, 0u, 0u};
    Dspic33 cpu;
    bool initialized = dspic33_initialize(&cpu);
    expect(&state, initialized, "initialize processor conformance");
    if (initialized) {
        program_target_address_error_cases(&state, &cpu);
        program_read_address_error_cases(&state, &cpu);
        compare_skip_cases(&state, &cpu);
        skip_boundary_cases(&state, &cpu);
        address_error_cases(&state, &cpu);
        data_map_address_error_cases(&state, &cpu);
        pseudo_linear_page_cases(&state, &cpu);
        page_zero_address_error_cases(&state, &cpu);
        unimplemented_data_page_address_error_cases(&state, &cpu);
        w15_write_cases(&state, &cpu);
        valid_stack_frame_cases(&state, &cpu);
        invalid_lnk_case(&state, &cpu);
        invalid_ulnk_case(&state, &cpu);
        simultaneous_trap_case(&state, &cpu);
        earlier_deadline_case(&state, &cpu);
        repeat_exception_cases(&state, &cpu);
        repeat_interrupt_cases(&state, &cpu);
        instruction_cycle_cases(&state, &cpu);
        register_move_instruction_cases(&state, &cpu);
        direct_file_move_cases(&state, &cpu);
        move_double_mode_cases(&state, &cpu);
        non_cpu_sfr_timing_cases(&state, &cpu);
        psv_timing_cases(&state, &cpu);
        psv_repeat_timing_cases(&state, &cpu);
        psv_program_hole_cases(&state, &cpu);
        address_register_dependency_cases(&state, &cpu);
        dsp_x_prefetch_page_cases(&state, &cpu);
        dsp_prefetch_address_error_cases(&state, &cpu);
        dsp_program_hole_prefetch_cases(&state, &cpu);
        call_stack_timing_case(&state, &cpu);
        move_double_stack_timing_cases(&state, &cpu);
        return_instruction_cycle_cases(&state, &cpu);
        retfie_stack_timing_case(&state, &cpu);
        interrupt_stack_timing_case(&state, &cpu);
        invalid_move_double_cases(&state, &cpu);
        invalid_dsp_encoding_cases(&state, &cpu);
        valid_dsp_register_pair_cases(&state, &cpu);
        dsp_prefetch_destination_collision_cases(&state, &cpu);
        dsp_encoding_matrix_cases(&state, &cpu);
        generic_multiply_encoding_matrix_cases(&state, &cpu);
        file_multiply_encoding_matrix_cases(&state, &cpu);
        illegal_condition_reset_cases(&state, &cpu);
        dspic33_destroy(&cpu);
    }
    printf("[processor-summary] cases=%" PRIu32 " passed=%" PRIu32 " failed=%" PRIu32
           "\n",
           state.cases, state.passed, state.failed);
    return state.failed == 0u ? 0 : 1;
}
